Белгипрозем_2017/src/InformationRegisters/СинхронизацияПапокПисемСМобильнымКлиентом/СинхронизацияПапокПисемСМобильнымКлиентом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СинхронизацияПапокПисемСМобильнымКлиентом</name>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиПисем</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/InformationRegisters/СведенияОМобильныхКлиентах/СведенияОМобильныхКлиентах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОМобильныхКлиентах</name>
  <resources>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МобильныйКлиент</name>
    <type>
      <types>ExchangePlanRef.Мобильный</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/CommonModules/ОбменСМобильнымиПовтИсп/Module.bsl
#Область ПрограммныйИнтерфейс

// Получает список папок писем, для которых включена синхронизация с указанным мобильным клиентом
Функция ПолучитьСинхронизируемыеПапкиПисем(МобильныйКлиент) Экспорт

	Возврат РегистрыСведений.СинхронизацияПапокПисемСМобильнымКлиентом.ПолучитьПапкиДляСинхронизации(
		МобильныйКлиент.Пользователь, Истина);

КонецФункции

// Получает представление и контакт адресата для передачи на мобильный клиент
Функция ПолучитьПредставлениеИКонтактАдресата(АдресатСсылка) Экспорт

	Возврат ВстроеннаяПочтаСервер.ПолучитьПредставлениеИКонтактАдресата(АдресатСсылка);

КонецФункции

// Возвращает массив не помеченных на удаление узлов плана обмена Мобильный
Функция ПолучитьВсеУзлы() Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПланыОбмена.Мобильный.ЭтотУзел());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Мобильный.Ссылка
		|ИЗ
		|	ПланОбмена.Мобильный КАК Мобильный
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОМобильныхКлиентах КАК СведенияОМобильныхКлиентах
		|		ПО Мобильный.Ссылка = СведенияОМобильныхКлиентах.МобильныйКлиент
		|ГДЕ
		|	Мобильный.ПометкаУдаления = ЛОЖЬ
		|	И Мобильный.Ссылка <> &Ссылка";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);

КонецФункции

// Получает массив ссылок на узла плана обмена Мобильный, принадлежащие указанному пользователю
// Параметры:
//	Пользователь - ссылка на пользователя
Функция ПолучитьУзлыОбменаПоВладельцу(Пользователь) Экспорт

	ЗапросПолучениеУзлов = Новый Запрос;
	ЗапросПолучениеУзлов.УстановитьПараметр("Пользователь", Пользователь);
	ЗапросПолучениеУзлов.УстановитьПараметр("Ссылка"      , ПланыОбмена.Мобильный.ЭтотУзел());
	ЗапросПолучениеУзлов.Текст = 
		"ВЫБРАТЬ
		|	Мобильный.Ссылка
		|ИЗ
		|	ПланОбмена.Мобильный КАК Мобильный
		|ГДЕ
		|	Мобильный.Пользователь = &Пользователь
		|	И Мобильный.ПометкаУдаления = ЛОЖЬ
		|	И Мобильный.Ссылка <> &Ссылка";

	Возврат ЗапросПолучениеУзлов.Выполнить().Выгрузить().ВыгрузитьКолонку(0);

КонецФункции

// Получает центральный узел регистрации всех изменений данных
Функция ПолучитьУзелДляРегистрацииДанных() Экспорт

	УзелОбменаСсылка = ПланыОбмена.МобильныйРегистрацияВсехДанных.НайтиПоКоду("1");

	Если Не ЗначениеЗаполнено(УзелОбменаСсылка) Тогда

		УзелОбменаОбъект = ПланыОбмена.МобильныйРегистрацияВсехДанных.СоздатьУзел();

		УзелОбменаОбъект.Код          = "1";
		УзелОбменаОбъект.Наименование = НСтр("ru = 'Единый узел для регистрации всех данных для мобильных клиентов'");

		УзелОбменаОбъект.Записать();

		Возврат УзелОбменаОбъект.Ссылка;

	Иначе

		Возврат УзелОбменаСсылка;

	КонецЕсли;

КонецФункции

#КонецОбласти
